Archived Projects/esol-hub-archive/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
      # simple_calendar expects an attribute (by default, `start_time`)
      @events = Event.all

INSERT INTO "events" ("name", "description", "start_time", "created_at", "updated_at") VALUES ('Event', 'Test', '2025-04-02 01:55:00', '2025-04-02 01:55:54.808557', '2025-04-02 01:55:54.808557') RETURNING "id"
---
    def create
      @event = Event.new(event_params)
      if @event.save