Archived Projects/esol-hub-archive/app/controllers/resources_controller.rb

  def index
    @resources = Resource.all

    # Filter by category if provided
    if params[:category].present?
      @resources = @resources.where(category: params[:category])
    end

    # Sort by name or category
    case params[:sort]
    when 'name_asc'
      @resources = @resources.order(name: :asc)
    when 'name_desc'
      @resources = @resources.order(name: :desc)
    when 'category_asc'
      @resources = @resources.order(category: :asc)
    when 'category_desc'
      @resources = @resources.order(category: :desc)
    end

    # Get all available categories for the filter dropdown
    @categories = Resource.distinct.pluck(:category).compact.sort
---
SELECT "resources".* FROM "resources"
SELECT "resources".* FROM "resources" WHERE "resources"."category" = 'Test'
SELECT DISTINCT "resources"."category" FROM "resources"

  def create
    @resource = Resource.new(resource_params)
    if @resource.save
---
INSERT INTO "resources" ("name", "created_at", "updated_at", "category") VALUES ('Test', '2025-04-06 22:39:15.257835', '2025-04-06 22:39:15.257835', 'Test') RETURNING "id"

  def destroy
    @resource.destroy
---
DELETE FROM "resources" WHERE "resources"."id" = 1

    def set_resource
      @resource = Resource.find(params[:id])
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = 1 LIMIT 1