Archived Projects/esol-hub-archive/app/controllers/simple_discussion/application_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (NULL, '2025-03-13 02:47:56.529865', '2025-03-13 02:47:56.529865') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'cody.s.snow@gmail.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
  def current_user # TODO: we need to check if user exists, and if not, redirect to info page that user needs to be activated on the system first. Check with client on desired flow.
    if session[:userinfo].present?
      @current_user ||= User.find_or_create_by(email: session[:userinfo]['email']) do |user|
        user.first_name = session[:userinfo]['name'].first # TODO: set first/last if not in database?