Archived Projects/esol-hub-archive/app/controllers/simple_discussion/forum_categories_controller.rb

SELECT "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."forum_category_id" = 2 ORDER BY "forum_threads"."pinned" DESC, "forum_threads"."updated_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "forum_threads" WHERE "forum_threads"."forum_category_id" = 2
---
  def index
    @forum_threads = ForumThread.where(forum_category: @category) if @category.present?
    @forum_threads = @forum_threads.pinned_first.sorted.includes(:user, :forum_category).paginate(per_page: 10, page: page_number)

SELECT "forum_categories".* FROM "forum_categories" WHERE "forum_categories"."id" = 2
---
  def set_category
    @category = ForumCategory.friendly.find(params[:id])