Archived Projects/esol-hub-archive/app/controllers/simple_discussion/forum_threads_controller.rb

  def index
    @forum_threads = ForumThread.pinned_first.sorted.includes(:user, :forum_category).paginate(page: page_number)
---
SELECT "forum_categories".* FROM "forum_categories" WHERE "forum_categories"."id" IN (6, 2)
SELECT "forum_threads".* FROM "forum_threads" ORDER BY "forum_threads"."pinned" DESC, "forum_threads"."updated_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "forum_threads"

  def answered
    @forum_threads = ForumThread.solved.sorted.includes(:user, :forum_category).paginate(page: page_number)
---
SELECT COUNT(*) FROM "forum_threads" WHERE "forum_threads"."solved" = TRUE

  def unanswered
    @forum_threads = ForumThread.unsolved.sorted.includes(:user, :forum_category).paginate(page: page_number)
---
SELECT "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."solved" != TRUE ORDER BY "forum_threads"."updated_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "forum_threads" WHERE "forum_threads"."solved" != TRUE

  def mine
    @forum_threads = ForumThread.where(user: current_user).sorted.includes(:user, :forum_category).paginate(page: page_number)
---
SELECT "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."user_id" = 1 ORDER BY "forum_threads"."updated_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "forum_threads" WHERE "forum_threads"."user_id" = 1

  def participating
    @forum_threads = ForumThread.includes(:user, :forum_category).joins(:forum_posts).where(forum_posts: {user_id: current_user.id}).distinct(forum_posts: :id).sorted.paginate(page: page_number)
---
SELECT COUNT(DISTINCT "forum_threads"."id") FROM "forum_threads" INNER JOIN "forum_posts" ON "forum_posts"."forum_thread_id" = "forum_threads"."id" WHERE "forum_posts"."user_id" = 1
SELECT DISTINCT "forum_threads".* FROM "forum_threads" INNER JOIN "forum_posts" ON "forum_posts"."forum_thread_id" = "forum_threads"."id" WHERE "forum_posts"."user_id" = 1 ORDER BY "forum_threads"."updated_at" DESC LIMIT 30 OFFSET 0

  def create
    @forum_thread = current_user.forum_threads.new(forum_thread_params)
    @forum_thread.forum_posts.each { |post| post.user_id = current_user.id }

    if @forum_thread.save
---
INSERT INTO "forum_posts" ("forum_thread_id", "user_id", "body", "solved", "created_at", "updated_at") VALUES (1, 1, 'free thing available', FALSE, '2025-03-17 15:57:21.313553', '2025-03-17 15:57:21.313553') RETURNING "id"
INSERT INTO "forum_threads" ("forum_category_id", "user_id", "title", "slug", "forum_posts_count", "pinned", "solved", "created_at", "updated_at") VALUES (2, 1, 'Free Stuff', 'free-stuff', 0, FALSE, FALSE, '2025-03-17 15:57:21.300476', '2025-03-17 15:57:21.300476') RETURNING "id"

  def update
    if @forum_thread.update(forum_thread_params)
---
UPDATE "forum_threads" SET "forum_posts_count" = COALESCE("forum_posts_count", 0) + 1, "updated_at" = '2025-03-17 15:57:21.320745' WHERE "forum_threads"."id" = 1

  def set_forum_thread
    @forum_thread = ForumThread.friendly.find(params[:id])
---
SELECT "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."id" = 2 LIMIT 1