Archived Projects/esol-hub-archive/app/controllers/simple_discussion/forum_posts_controller.rb

INSERT INTO "forum_posts" ("forum_thread_id", "user_id", "body", "solved", "created_at", "updated_at") VALUES (2, 1, 'Chain of comments
---
  def create
    @forum_post = @forum_thread.forum_posts.new(forum_post_params)
    @forum_post.user_id = current_user.id

    if @forum_post.save